{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_layer_1"}, "registered_name": null, "name": "input_layer_1", "inbound_nodes": []}, {"module": null, "class_name": "EncoderBlock", "config": {"name": "Encoder1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "rate": 0.1, "pooling": true}, "registered_name": "Custom>EncoderBlock", "build_config": {"input_shape": [null, 256, 256, 3]}, "name": "Encoder1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256, 256, 3], "dtype": "float32", "keras_history": ["input_layer_1", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "EncoderBlock", "config": {"name": "Encoder2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "rate": 0.1, "pooling": true}, "registered_name": "Custom>EncoderBlock", "build_config": {"input_shape": [null, 128, 128, 32]}, "name": "Encoder2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 32], "dtype": "float32", "keras_history": ["Encoder1", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "EncoderBlock", "config": {"name": "Encoder3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "rate": 0.2, "pooling": true}, "registered_name": "Custom>EncoderBlock", "build_config": {"input_shape": [null, 64, 64, 64]}, "name": "Encoder3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 64], "dtype": "float32", "keras_history": ["Encoder2", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "EncoderBlock", "config": {"name": "Encoder4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "rate": 0.2, "pooling": true}, "registered_name": "Custom>EncoderBlock", "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "Encoder4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["Encoder3", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "EncoderBlock", "config": {"name": "Encoding", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "rate": 0.3, "pooling": false}, "registered_name": "Custom>EncoderBlock", "build_config": {"input_shape": [null, 16, 16, 256]}, "name": "Encoding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 256], "dtype": "float32", "keras_history": ["Encoder4", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "AttentionGate", "config": {"name": "Attention1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "bn": true}, "registered_name": "AttentionGate", "build_config": {"input_shape": [[null, 16, 16, 512], [null, 32, 32, 256]]}, "name": "Attention1", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 512], "dtype": "float32", "keras_history": ["Encoding", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 256], "dtype": "float32", "keras_history": ["Encoder4", 0, 1]}}]], "kwargs": {}}]}, {"module": null, "class_name": "DecoderBlock", "config": {"name": "Decoder1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "rate": 0.2}, "registered_name": "Custom>DecoderBlock", "build_config": {"input_shape": [[null, 16, 16, 512], [null, 32, 32, 256]]}, "name": "Decoder1", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 512], "dtype": "float32", "keras_history": ["Encoding", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 256], "dtype": "float32", "keras_history": ["Attention1", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "AttentionGate", "config": {"name": "Attention2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "bn": true}, "registered_name": "AttentionGate", "build_config": {"input_shape": [[null, 32, 32, 256], [null, 64, 64, 128]]}, "name": "Attention2", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 256], "dtype": "float32", "keras_history": ["Decoder1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 128], "dtype": "float32", "keras_history": ["Encoder3", 0, 1]}}]], "kwargs": {}}]}, {"module": null, "class_name": "DecoderBlock", "config": {"name": "Decoder2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "rate": 0.2}, "registered_name": "Custom>DecoderBlock", "build_config": {"input_shape": [[null, 32, 32, 256], [null, 64, 64, 128]]}, "name": "Decoder2", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 256], "dtype": "float32", "keras_history": ["Decoder1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 128], "dtype": "float32", "keras_history": ["Attention2", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "AttentionGate", "config": {"name": "Attention3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "bn": true}, "registered_name": "AttentionGate", "build_config": {"input_shape": [[null, 64, 64, 128], [null, 128, 128, 64]]}, "name": "Attention3", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 128], "dtype": "float32", "keras_history": ["Decoder2", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 64], "dtype": "float32", "keras_history": ["Encoder2", 0, 1]}}]], "kwargs": {}}]}, {"module": null, "class_name": "DecoderBlock", "config": {"name": "Decoder3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "rate": 0.1}, "registered_name": "Custom>DecoderBlock", "build_config": {"input_shape": [[null, 64, 64, 128], [null, 128, 128, 64]]}, "name": "Decoder3", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 64, 128], "dtype": "float32", "keras_history": ["Decoder2", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 64], "dtype": "float32", "keras_history": ["Attention3", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "AttentionGate", "config": {"name": "Attention4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "bn": true}, "registered_name": "AttentionGate", "build_config": {"input_shape": [[null, 128, 128, 64], [null, 256, 256, 32]]}, "name": "Attention4", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 64], "dtype": "float32", "keras_history": ["Decoder3", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 256, 256, 32], "dtype": "float32", "keras_history": ["Encoder1", 0, 1]}}]], "kwargs": {}}]}, {"module": null, "class_name": "DecoderBlock", "config": {"name": "Decoder4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "rate": 0.1}, "registered_name": "Custom>DecoderBlock", "build_config": {"input_shape": [[null, 128, 128, 64], [null, 256, 256, 32]]}, "name": "Decoder4", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 64], "dtype": "float32", "keras_history": ["Decoder3", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 256, 256, 32], "dtype": "float32", "keras_history": ["Attention4", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_61", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 32]}, "name": "conv2d_61", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256, 256, 32], "dtype": "float32", "keras_history": ["Decoder4", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_1", 0, 0]], "output_layers": [["conv2d_61", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}